/*Зберігати мітки "непрочитане"
важливість: 5
Є масив повідомлень:

let messages = [
  {text: "Привіт", from: "Іван"},
  {text: "Як справи?", from: "Іван"},
  {text: "До зустрічі", from: "Аліса"}
];
Ваш код може отримати доступ до нього, але повідомлення керуються чужим кодом. 
Нові повідомлення додаються, старі видаляються регулярно цим кодом, і ви не знаєте точних моментів, коли це станеться.

Тепер, яку структуру даних ви могли б використати для зберігання інформації про те, 
чи було повідомлення прочитаним? Структура повинна добре підходити, щоб дати відповідь на питання “чи він прочитаний?” 
для об’єкта даного повідомлення.

P.S. Коли повідомлення видаляється з messages, воно також повинне зникнути з вашої структури.

P.P.S. Ми не повинні змінювати об’єкти повідомлення, додаючи до них наші властивості. 
Оскільки вони керуються іншим кодом, це може призвести до поганих наслідків.*/

/* - - - Моя відповідь - - -*/
let messages = [
    {text: "Привіт", from: "Іван"},
    {text: "Як справи?", from: "Іван"},
    {text: "До зустрічі", from: "Аліса"}
];
let readMessages = new WeakSet ();
readMessages.add(messages[0]);
readMessages.add(messages[1]);
readMessages.add(messages[2]);
console.log (readMessages.has(messages[0]))